photon_bench.txt
Photon
——————

1) 1 worker, low concurrency

➜  benchmarks oha -c 10 -z 30s http://localhost:8080/
oha -c 50 -z 30s http://localhost:8080/
oha -c 100 -z 30s http://localhost:8080/
Summary:
  Success rate: 100.00%
  Total:        30000.5326 ms
  Slowest:      2.4557 ms
  Fastest:      0.0204 ms
  Average:      0.0773 ms
  Requests/sec: 125182.4775

  Total data:   46.56 MiB
  Size/request: 13 B
  Size/sec:     1.55 MiB

Response time histogram:
  0.020 ms [1]       |
  0.264 ms [3711061] |■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.507 ms [18808]   |
  0.751 ms [7371]    |
  0.994 ms [4026]    |
  1.238 ms [8109]    |
  1.482 ms [6115]    |
  1.725 ms [16]      |
  1.969 ms [16]      |
  2.212 ms [7]       |
  2.456 ms [6]       |

Response time distribution:
  10.00% in 0.0440 ms
  25.00% in 0.0555 ms
  50.00% in 0.0692 ms
  75.00% in 0.0804 ms
  90.00% in 0.0927 ms
  95.00% in 0.1070 ms
  99.00% in 0.3248 ms
  99.90% in 1.2892 ms
  99.99% in 1.4163 ms


Details (average, fastest, slowest):
  DNS+dialup:   0.1840 ms, 0.0890 ms, 0.4563 ms
  DNS-lookup:   0.0121 ms, 0.0038 ms, 0.0230 ms

Status code distribution:
  [200] 3755536 responses

Error distribution:
  [5] aborted due to deadline
Summary:
  Success rate: 100.00%
  Total:        30001.2082 ms
  Slowest:      2.3295 ms
  Fastest:      0.0244 ms
  Average:      0.4048 ms
  Requests/sec: 122768.0224

  Total data:   45.66 MiB
  Size/request: 13 B
  Size/sec:     1.52 MiB

Response time histogram:
  0.024 ms [1]       |
  0.255 ms [46914]   |
  0.485 ms [3574179] |■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.716 ms [43492]   |
  0.946 ms [8050]    |
  1.177 ms [1143]    |
  1.407 ms [2615]    |
  1.638 ms [5532]    |
  1.868 ms [1166]    |
  2.099 ms [52]      |
  2.329 ms [16]      |

Response time distribution:
  10.00% in 0.3688 ms
  25.00% in 0.3823 ms
  50.00% in 0.4006 ms
  75.00% in 0.4227 ms
  90.00% in 0.4415 ms
  95.00% in 0.4539 ms
  99.00% in 0.5320 ms
  99.90% in 1.5196 ms
  99.99% in 1.7433 ms


Details (average, fastest, slowest):
  DNS+dialup:   0.6887 ms, 0.0683 ms, 1.3752 ms
  DNS-lookup:   0.0056 ms, 0.0024 ms, 0.0315 ms

Status code distribution:
  [200] 3683160 responses

Error distribution:
  [29] aborted due to deadline
Summary:
  Success rate: 100.00%
  Total:        30001.6309 ms
  Slowest:      24.6061 ms
  Fastest:      0.0277 ms
  Average:      0.8338 ms
  Requests/sec: 119499.9701

  Total data:   44.45 MiB
  Size/request: 13 B
  Size/sec:     1.48 MiB

Response time histogram:
   0.028 ms [1]       |
   2.486 ms [3584904] |■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
   4.943 ms [197]     |
   7.401 ms [4]       |
   9.859 ms [4]       |
  12.317 ms [3]       |
  14.775 ms [3]       |
  17.233 ms [3]       |
  19.690 ms [1]       |
  22.148 ms [0]       |
  24.606 ms [61]      |

Response time distribution:
  10.00% in 0.7664 ms
  25.00% in 0.7874 ms
  50.00% in 0.8284 ms
  75.00% in 0.8724 ms
  90.00% in 0.9020 ms
  95.00% in 0.9215 ms
  99.00% in 1.1131 ms
  99.90% in 1.9202 ms
  99.99% in 2.3717 ms


Details (average, fastest, slowest):
  DNS+dialup:   14.1509 ms, 0.1049 ms, 23.6828 ms
  DNS-lookup:   0.0057 ms, 0.0029 ms, 0.0339 ms

Status code distribution:
  [200] 3585181 responses

Error distribution:
  [13] aborted due to deadline

2) 4 workers, low concurrency
➜  benchmarks sudo vim /etc/security/limits.d/99-benchmark.conf
➜  benchmarks
➜  benchmarks
➜  benchmarks oha -c 10 -z 30s http://localhost:8080/
oha -c 50 -z 30s http://localhost:8080/
oha -c 100 -z 30s http://localhost:8080/
oha -c 200 -z 30s http://localhost:8080/
Summary:
  Success rate: 100.00%
  Total:        30000.6481 ms
  Slowest:      2.3107 ms
  Fastest:      0.0226 ms
  Average:      0.0534 ms
  Requests/sec: 177184.0054

  Total data:   65.90 MiB
  Size/request: 13 B
  Size/sec:     2.20 MiB

Response time histogram:
  0.023 ms [1]       |
  0.251 ms [5314196] |■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.480 ms [95]      |
  0.709 ms [25]      |
  0.938 ms [24]      |
  1.167 ms [479]     |
  1.395 ms [809]     |
  1.624 ms [0]       |
  1.853 ms [0]       |
  2.082 ms [0]       |
  2.311 ms [3]       |

Response time distribution:
  10.00% in 0.0405 ms
  25.00% in 0.0453 ms
  50.00% in 0.0518 ms
  75.00% in 0.0592 ms
  90.00% in 0.0673 ms
  95.00% in 0.0729 ms
  99.00% in 0.0860 ms
  99.90% in 0.1305 ms
  99.99% in 1.1730 ms


Details (average, fastest, slowest):
  DNS+dialup:   0.1416 ms, 0.0816 ms, 0.3282 ms
  DNS-lookup:   0.0118 ms, 0.0033 ms, 0.0196 ms

Status code distribution:
  [200] 5315632 responses

Error distribution:
  [3] aborted due to deadline
Summary:
  Success rate: 100.00%
  Total:        30000.4114 ms
  Slowest:      13.4187 ms
  Fastest:      0.0258 ms
  Average:      0.1806 ms
  Requests/sec: 272663.0939

  Total data:   101.41 MiB
  Size/request: 13 B
  Size/sec:     3.38 MiB

Response time histogram:
   0.026 ms [1]       |
   1.365 ms [8177413] |■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
   2.704 ms [2574]    |
   4.044 ms [0]       |
   5.383 ms [0]       |
   6.722 ms [0]       |
   8.062 ms [0]       |
   9.401 ms [0]       |
  10.740 ms [0]       |
  12.079 ms [0]       |
  13.419 ms [8]       |

Response time distribution:
  10.00% in 0.1105 ms
  25.00% in 0.1420 ms
  50.00% in 0.1765 ms
  75.00% in 0.2128 ms
  90.00% in 0.2483 ms
  95.00% in 0.2714 ms
  99.00% in 0.3265 ms
  99.90% in 1.3012 ms
  99.99% in 1.4106 ms


Details (average, fastest, slowest):
  DNS+dialup:   0.5425 ms, 0.0916 ms, 0.9296 ms
  DNS-lookup:   0.0064 ms, 0.0027 ms, 0.0339 ms

Status code distribution:
  [200] 8179996 responses

Error distribution:
  [9] aborted due to deadline
Summary:
  Success rate: 100.00%
  Total:        30000.7172 ms
  Slowest:      24.0383 ms
  Fastest:      0.0267 ms
  Average:      0.3473 ms
  Requests/sec: 285577.5395

  Total data:   106.22 MiB
  Size/request: 13 B
  Size/sec:     3.54 MiB

Response time histogram:
   0.027 ms [1]       |
   2.428 ms [8566742] |■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
   4.829 ms [711]     |
   7.230 ms [0]       |
   9.631 ms [0]       |
  12.032 ms [0]       |
  14.434 ms [0]       |
  16.835 ms [0]       |
  19.236 ms [0]       |
  21.637 ms [0]       |
  24.038 ms [60]      |

Response time distribution:
  10.00% in 0.2027 ms
  25.00% in 0.2653 ms
  50.00% in 0.3364 ms
  75.00% in 0.4125 ms
  90.00% in 0.4892 ms
  95.00% in 0.5422 ms
  99.00% in 0.7016 ms
  99.90% in 1.5917 ms
  99.99% in 2.3409 ms


Details (average, fastest, slowest):
  DNS+dialup:   13.8825 ms, 0.1322 ms, 23.3890 ms
  DNS-lookup:   0.0061 ms, 0.0024 ms, 0.0215 ms

Status code distribution:
  [200] 8567514 responses

Error distribution:
  [17] aborted due to deadline
Summary:
  Success rate: 100.00%
  Total:        30001.2703 ms
  Slowest:      33.7324 ms
  Fastest:      0.0286 ms
  Average:      0.6702 ms
  Requests/sec: 296984.8584

  Total data:   110.46 MiB
  Size/request: 13 B
  Size/sec:     3.68 MiB

Response time histogram:
   0.029 ms [1]       |
   3.399 ms [8909160] |■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
   6.769 ms [589]     |
  10.140 ms [17]      |
  13.510 ms [62]      |
  16.880 ms [0]       |
  20.251 ms [0]       |
  23.621 ms [0]       |
  26.992 ms [0]       |
  30.362 ms [0]       |
  33.732 ms [62]      |

Response time distribution:
  10.00% in 0.3792 ms
  25.00% in 0.5041 ms
  50.00% in 0.6463 ms
  75.00% in 0.8023 ms
  90.00% in 0.9658 ms
  95.00% in 1.0851 ms
  99.00% in 1.5424 ms
  99.90% in 2.2605 ms
  99.99% in 3.2357 ms


Details (average, fastest, slowest):
  DNS+dialup:   13.6876 ms, 0.1462 ms, 32.9731 ms
  DNS-lookup:   0.0052 ms, 0.0020 ms, 0.0210 ms

Status code distribution:
  [200] 8909891 responses

Error distribution:
  [32] aborted due to deadline
➜  benchmarks

3) For the test, lets stick to 4 workers. As our CPUs are not close to be saturated
➜  ~ oha -c 200 -z 60s http://localhost:8080/
oha -c 400 -z 60s http://localhost:8080/
oha -c 800 -z 60s http://localhost:8080/
oha -c 1000 -z 60s http://localhost:8080/
oha -c 1500 -z 60s http://localhost:8080/
Summary:
  Success rate: 100.00%
  Total:        60001.0984 ms
  Slowest:      33.7099 ms
  Fastest:      0.0267 ms
  Average:      0.6774 ms
  Requests/sec: 293956.9187

  Total data:   218.67 MiB
  Size/request: 13 B
  Size/sec:     3.64 MiB

Response time histogram:
   0.027 ms [1]        |
   3.395 ms [17636576] |■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
   6.763 ms [807]      |
  10.132 ms [5]        |
  13.500 ms [0]        |
  16.868 ms [193]      |
  20.237 ms [0]        |
  23.605 ms [64]       |
  26.973 ms [0]        |
  30.342 ms [0]        |
  33.710 ms [60]       |

Response time distribution:
  10.00% in 0.3845 ms
  25.00% in 0.5102 ms
  50.00% in 0.6538 ms
  75.00% in 0.8106 ms
  90.00% in 0.9778 ms
  95.00% in 1.1011 ms
  99.00% in 1.5071 ms
  99.90% in 2.2442 ms
  99.99% in 3.1330 ms


Details (average, fastest, slowest):
  DNS+dialup:   16.7310 ms, 0.1437 ms, 32.9771 ms
  DNS-lookup:   0.0056 ms, 0.0023 ms, 0.0254 ms

Status code distribution:
  [200] 17637706 responses

Error distribution:
  [32] aborted due to deadline
Summary:
  Success rate: 100.00%
  Total:        60003.1817 ms
  Slowest:      55.9214 ms
  Fastest:      0.0325 ms
  Average:      1.3709 ms
  Requests/sec: 290983.2527

  Total data:   216.46 MiB
  Size/request: 13 B
  Size/sec:     3.61 MiB

Response time histogram:
   0.032 ms [1]        |
   5.621 ms [17458714] |■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  11.210 ms [887]      |
  16.799 ms [12]       |
  22.388 ms [0]        |
  27.977 ms [105]      |
  33.566 ms [23]       |
  39.155 ms [0]        |
  44.744 ms [62]       |
  50.333 ms [0]        |
  55.921 ms [62]       |

Response time distribution:
  10.00% in 0.7576 ms
  25.00% in 1.0217 ms
  50.00% in 1.3228 ms
  75.00% in 1.6615 ms
  90.00% in 2.0275 ms
  95.00% in 2.2859 ms
  99.00% in 2.8845 ms
  99.90% in 3.8238 ms
  99.99% in 5.1564 ms


Details (average, fastest, slowest):
  DNS+dialup:   22.9491 ms, 0.0601 ms, 54.5710 ms
  DNS-lookup:   0.0058 ms, 0.0023 ms, 0.0249 ms

Status code distribution:
  [200] 17459866 responses

Error distribution:
  [55] aborted due to deadline
Summary:
  Success rate: 100.00%
  Total:        60005.3317 ms
  Slowest:      77.9206 ms
  Fastest:      0.0344 ms
  Average:      2.7560 ms
  Requests/sec: 289700.7065

  Total data:   215.52 MiB
  Size/request: 13 B
  Size/sec:     3.59 MiB

Response time histogram:
   0.034 ms [1]        |
   7.823 ms [17372640] |■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  15.612 ms [9032]     |
  23.400 ms [834]      |
  31.189 ms [629]      |
  38.977 ms [102]      |
  46.766 ms [142]      |
  54.555 ms [72]       |
  62.343 ms [0]        |
  70.132 ms [0]        |
  77.921 ms [62]       |

Response time distribution:
  10.00% in 1.6060 ms
  25.00% in 2.1143 ms
  50.00% in 2.6849 ms
  75.00% in 3.2945 ms
  90.00% in 3.9481 ms
  95.00% in 4.4174 ms
  99.00% in 5.5985 ms
  99.90% in 7.3662 ms
  99.99% in 16.3489 ms


Details (average, fastest, slowest):
  DNS+dialup:   23.6251 ms, 0.0843 ms, 73.3303 ms
  DNS-lookup:   0.0051 ms, 0.0019 ms, 0.0281 ms

Status code distribution:
  [200] 17383514 responses

Error distribution:
  [73] aborted due to deadline
Summary:
  Success rate: 100.00%
  Total:        60006.9451 ms
  Slowest:      102.6707 ms
  Fastest:      0.0344 ms
  Average:      3.5269 ms
  Requests/sec: 283052.0531

  Total data:   210.58 MiB
  Size/request: 13 B
  Size/sec:     3.51 MiB

Response time histogram:
    0.034 ms [1]        |
   10.298 ms [16973511] |■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
   20.562 ms [8290]     |
   30.825 ms [2081]     |
   41.089 ms [553]      |
   51.353 ms [351]      |
   61.616 ms [65]       |
   71.880 ms [62]       |
   82.143 ms [0]        |
   92.407 ms [0]        |
  102.671 ms [8]        |

Response time distribution:
  10.00% in 1.9813 ms
  25.00% in 2.6577 ms
  50.00% in 3.4174 ms
  75.00% in 4.2340 ms
  90.00% in 5.1602 ms
  95.00% in 5.8249 ms
  99.00% in 7.3603 ms
  99.90% in 9.6563 ms
  99.99% in 26.8548 ms


Details (average, fastest, slowest):
  DNS+dialup:   20.2477 ms, 0.0691 ms, 64.9068 ms
  DNS-lookup:   0.0051 ms, 0.0019 ms, 0.0236 ms

Status code distribution:
  [200] 16984922 responses

Error distribution:
  [167] aborted due to deadline
Summary:
  Success rate: 100.00%
  Total:        60010.1677 ms
  Slowest:      263.6347 ms
  Fastest:      0.0367 ms
  Average:      5.6223 ms
  Requests/sec: 266291.2904

  Total data:   198.12 MiB
  Size/request: 13 B
  Size/sec:     3.30 MiB

Response time histogram:
    0.037 ms [1]        |
   26.396 ms [15971805] |■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
   52.756 ms [7489]     |
   79.116 ms [535]      |
  105.476 ms [87]       |
  131.836 ms [87]       |
  158.195 ms [26]       |
  184.555 ms [24]       |
  210.915 ms [24]       |
  237.275 ms [21]       |
  263.635 ms [22]       |

Response time distribution:
  10.00% in 3.0266 ms
  25.00% in 4.1055 ms
  50.00% in 5.4156 ms
  75.00% in 6.8193 ms
  90.00% in 8.4026 ms
  95.00% in 9.5066 ms
  99.00% in 11.9275 ms
  99.90% in 16.2031 ms
  99.99% in 47.4481 ms


Details (average, fastest, slowest):
  DNS+dialup:   27.6396 ms, 0.0555 ms, 101.2569 ms
  DNS-lookup:   0.0048 ms, 0.0019 ms, 0.0209 ms

Status code distribution:
  [200] 15980121 responses

Error distribution:
  [64] aborted due to deadline
➜  ~